{"artist1":{"name":"Edgar Allan Poe","instrument":"poems","bio":"Edgar Allan Poe considered himself a poet first and foremost. But economic necessity forced his literary talents in the more profitable directions of literary journalism and fiction. To support himself and his family, he worked tirelessly as an editor, journalist, lecturer and critic, contributing a steady stream of stories and reviews to magazines and newspapers. All his life he remained a frustrated poet, prevented by poverty and life circumstances from dedicating all his abilities to what he \tconsidered his true calling, writing poetry.","photo":"Edgar_Allan_Poe.png"},"artist2":{"name":"Daniel Rein","instrument":"composition & arrangements, vocals, piano, harpsichord, organ, synth","bio":"Daniel Rein grew up in Jerusalem, Israel, amid a cultural mosaic that blends Jewish, Christian, and Islamic influences. As an artist shaped by the cultural diversity of his native city, Daniel displays rare creativity and virtuosity across musical genres and has established an international career as a versatile pianist, composer, and music director. Now based in New York, Daniel is a member of the prestigious BMI Lehman Engel Musical Theatre Workshop, a program widely regarded as the premier training ground for emerging musical theater composers, lyricists, and librettists. He holds a Bachelors degree from the Jerusalem Academy of Music and a Postgraduate Diploma from the Royal Academy Of Music in London. As a composer and song-writer, Daniel's recent projects and commissions include Her Violet Eye, a song cycle based on Edgar Allan Poe's poetry, and Improvisations On Misirlou, a mini-concerto for piano based on a Greek folk song. Daniel spent two years as music director for the Cats European tour and a year as Associate Conductor on the 25th Anniversary Tour of Les Miserables. Recent Broadway credits include pianist for On The Town, as well as for the New York Philharmonic's production of Showboat, conducted by Ted Sperling. As a concert pianist, Daniel excels in both classical and jazz repertoire. He has competed in international classical piano competitions and performed with the Israeli Philharmonic Orchestra, at the International Association for Jazz Education Conference in California, and in various jazz venues in New York and Israel.","photo":"Daniel_Rein.png"},"artist3":{"name":"Yoav Shemesh","instrument":"Music Production","bio":"Yoav Shemesh is an Israeli-born composer and music producer based in NYC. He works extensively as a composer of concert music, theater, film and contemporary dance. He has written for solo instruments, chamber ensembles and full symphony orchestras. Over the last few years Yoav has been exploring Ashkenazi Niguns and Sephardic Piutim, the traditional Jewish tunes of the two worlds comprising the Jewish exile. His orchestral work ‘Running to Return’ Based on a Chabad niggun has received its Israeli premier this year as well as a chinese premiere on 2014. Notable collaborations and commissions include The Israel Symphony Orchestra Rishon LeZion, Raanana Symphonette Orchestra, The Jerusalem Symphony Orchestra, The Israel Sinfonietta Beer Sheva, The Revolution Orchestra and NYU Symphony Orchestra. His compositions have been performed in various festivals and venues around the world, such as The Bang on a Can Summer Music Festival MASS MoCA, Music With a View Festival, 92Y Tribeca, Skirball Center (NY), as well as Sounds in The Desserts, The Israeli Opera House and The Jerusalem Theatre among others. He has written music for films that have been screened in over 40 festivals around the world including the Aniwow- Beijing Festival and the 25th Interfilm International Short Film Festival, Berlin.","photo":"Yoav_Shemesh.jpg"},"artist4":{"name":"Yonatan Levy","instrument":"Bass, guitar","bio":"Jonathan Levy is an Israeli musician born to parents of German and Moroccan origin. His musical career began at age eighteen, when he was chosen to play bass with Israel’s leading singer-song writer Yudit Ravitz. Within a short time he became a sought-after session musician who recorded over a hundred records and toured with Israel’s top artists both in Israel and worldwide. The purchase of a eight-track tape machine at age twenty four marked the beginning of what he defines as “my love affair with sound”. What began as a small music studio soon turned into a thriving career as music producer of many records and award winning music. In 2001 Jonathan joined Izabo band. Two years later the band was signed to SONY BMG, and their debut album, “Morning Hero”, was released in the United Kingdom. The same album was also released in France, Belgium and the Netherlands under the title “The Fun Makers”. A second album, “Superlight”, followed in 2009. In 2012 Izabo were signed to 100% Records, where they released their third album “Life Is On My Side”. Highly acclaimed for their unique musical style, Izabo toured all over Europe, and were chosen to represent Israel in the Eurovision Song Contest. Jonathan Levy presently resides in New York City.","photo":"Yonatan_Levy.jpg"},"artist5":{"name":"Fina Strazza","instrument":"vocals","bio":"A native New Yorker with film, television, stage, and recording experience, Fina's fate-favored turn came at eight years old when she was cast to share the title role of Broadway's Matilda the Musical.  She debuted as the youngest to perform the role and exited as Broadway's longest-running Matilda.  She was chosen by Mariah Carey to star in her directorial debut, Hallmark Channel's, 'A Christmas Melody,' wherein she performs the Carey-produced version of her number-one hit, \"Oh Santa.\"  With three feature films, 'Callahan', 'Tribe', and 'Shadow Girl,' scheduled for 2018 release, Fina returns to the stage to originate the titular role of Arena Stage's world premier musical, SNOW CHILD.","photo":"Fina_Strazza.webp"}}